app/Controllers/Admin/Usuarios.php

SELECT *
FROM `usuarios`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
---
    public function index()
    {
        $data = [
            'titulo' => 'Listando os usuários',
            'usuarios' => $this->usuarioModel->withDeleted(true)->paginate(10),

INSERT INTO `usuarios` (`name`, `cpf`, `telefone`, `email`, `ativo`, `is_admin`, `criado_em`, `atualizado_em`, `password_hash`) VALUES ('Nicole JOia', '123.456.789-54', '(16) 9.9964-9068', 'nicole@nicole.com', '0', '0', '2022-08-30 16:19:47', '2022-08-30 16:19:47', '$2y$10$ev0Gr3ardYWbk1eZZZ082eVd9cv30sh8wN64Kjcp3nEviEnU1rT9u')
---
    public function cadastrar()
    {
        if ($this->request->getMethod() === 'post') {

            $usuario = new Usuario($this->request->getPost());
            //dd($usuario);

            if ($this->usuarioModel->protect(false)->save($usuario)) {

SELECT *
FROM `usuarios`
WHERE `id` = 3
GROUP BY `usuarios`.`id`
ORDER BY `usuarios`.`id` ASC
 LIMIT 1
---
    private function buscaUsuarioOu404(int $id = null)
    {
        if (!$id || !$usuario = $this->usuarioModel->withDeleted(true)->where('id', $id)->first()) {