app/Models/UsuarioModel.php

SELECT `id`, `name`
FROM `usuarios`
WHERE `name` LIKE '%marcelo %' ESCAPE '!'
---
    public function procurar($term)
    {
        if ($term === null) {
            return [];
        }

        return $this->select('id, name')
            ->like('name', $term)
            ->get()
            ->getResult();